In [2]:
import pandas as pd
dict1 = {'Name':['Priyang', 'Aadhya', 'Krishna','Vedant','Parshv',
                 'Mittal','Archana'],
         'Marks':[98,89,99,87,90,83,99],
         'Gender':['Male','Female','Female','Male','Male',
                   'Female','Female']
        }
df1 = pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## 1. Display top 3 rows of the dataset

In [4]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female

## 2. Check last 3rows of the dataset

In [6]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## Find the shape of our dataset(number  of rows & number of columns)

In [7]:
df1.shape

(7, 3)

In [9]:
print('Number of rows',df1.shape[0])
print('Number of columns',df1.shape[1])

Number of rows 7
Number of columns 3

## Get info about our dataset like total number rows,total numbers of columns, datatypes of each column and memory reuirement

In [10]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

## 5. Check null values in the dataset

In [12]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [14]:
df1.isnull().sum(axis = 0)

Name      0
Marks     0
Gender    0
dtype: int64

In [15]:
df1.isnull().sum(axis = 1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

## 6. Get overall statistics about the dataFrame

In [16]:
 df1.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [17]:
df1.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

## Find the uniue values from the gender column

In [18]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [22]:
df1['Gender']

0      Male
1    Female
2    Female
3      Male
4      Male
5    Female
6    Female
Name: Gender, dtype: object

In [23]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

## Find the number of uniue values in gender column

In [24]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

## Display count of unniue values in gender column

In [25]:
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

## 10. Find total number of students having marks between 90 to 100 (inclusive) using betweem method

In [29]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2  Krishna     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [32]:
len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)]

4

In [35]:
df1['Marks'].between(90,100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [36]:
sum(df1['Marks'].between(90,100))

4

## 11. Find the Average Marks

In [39]:
df1['Marks'].mean()

np.float64(92.14285714285714)

In [40]:
df1['Marks'].max()

np.int64(99)

## 12. Apply Method

In [45]:
def marks(x):
    return x//2

In [46]:
df1['Marks'].apply(marks)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [47]:
df1['Half_marks'] = df1['Marks'].apply(marks)

In [48]:
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2  Krishna     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [49]:
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [50]:
df1['Name'].apply(len)

0    7
1    6
2    7
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

## 13. Map Function

In [52]:
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2  Krishna     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [53]:
df1['Gender'].map({'Male':1, 'Female':0})

0    1
1    0
2    0
3    1
4    1
5    0
6    0
Name: Gender, dtype: int64

In [54]:
df1['Male_Female'] = df1['Gender'].map({'Male':1, 'Female':0})

In [55]:
df1

      Name  Marks  Gender  Half_marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2  Krishna     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

## 14. Drop the columns(s)

In [57]:
df1

      Name  Marks  Gender  Half_marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2  Krishna     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [59]:
df1.drop('Male_Female', axis = 1)

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2  Krishna     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [61]:
df1.drop(['Male_Female','Half_marks'], axis = 1, inplace = True)

In [62]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [64]:
## Print name of the columns

In [65]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [66]:
df1.index

RangeIndex(start=0, stop=7, step=1)

In [67]:
## 16. sort the dataframe as per the marks column

In [68]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [69]:
df1.sort_values(by='Marks')

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2  Krishna     99  Female
6  Archana     99  Female

In [72]:
df1.sort_values(by=['Marks','Gender'],ascending=False)

      Name  Marks  Gender
2  Krishna     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [73]:
## Display name and marks of the female student:

In [74]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [80]:
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2  Krishna     99
5   Mittal     83
6  Archana     99